/* Створіть клас під назвою «Воїн», який обчислює та відстежує їхній рівень і навички, а також оцінює їх як воїнів, якими вони довели себе.

Правила бізнесу:

     Воїн починає з рівня 1 і може прогресувати аж до 100.
     Воїн починає з рангу «Pushover» і може прогресувати аж до «Greatest».
     Єдиний прийнятний діапазон значень рангу: «Поштовх», «Новачок», «Боєць», «Воїн», «Ветеран», «Мудрець», «Елітний», «Завойовник», «Чемпіон», «Майстер», «Найвеличніший». ".
     Воїни будуть змагатися в боях. У битвах завжди прийматиметься рівень ворога, щоб протистояти вашому власному.
     З кожною успішно завершеною битвою досвід вашого воїна оновлюється залежно від рівня ворога.
     Досвід, отриманий у бою, залежить від поточного рівня воїна та рівня ворога.
     Досвід воїна починається зі 100. Кожного разу, коли досвід воїна збільшується ще на 100, рівень воїна піднімається на наступний рівень.
     Досвід воїна накопичується і не скидається з кожним підвищенням рівня. Єдиний виняток — коли воїн досягає рівня 100, після чого досвід припиняється на 10000
     На кожних 10 рівнях ваш воїн досягне нового рангу. (наприклад, рівні 1-9 належать до рівня "Pushover", рівні 80-89 належать до рівня "Чемпіон" тощо)
     Воїн не може перевищувати рівень 100 і отримати ранг «Найбільший».

Правила та обчислення ходу битви:

     Якщо рівень ворога не впадає в діапазон від 1 до 100, битва не може відбутися, і має повернутися «Недійсний рівень».
     За завершення битви з ворогом такого ж рівня, як і ваш воїн, ви отримаєте 10 очок досвіду.
     Завершення бою проти ворога, який на один рівень нижчий за вашого воїна, коштуватиме 5 очок досвіду.
     Завершення бою проти ворога, який на два рівні нижче або нище, ніж ваш воїн, дасть 0 очок досвіду.
     Завершивши битву проти ворога, який на один рівень вищий або вищий за вашого воїна, ви прискорите отримання досвіду. Чим більша різниця між рівнями, тим більше досвіду отримає ваш воїн. Формула 20 * diff * diff, де diff дорівнює різниці рівнів між ворогом і вашим воїном.
     Однак, якщо ваш воїн принаймні на один ранг нижчий за вашого ворога і принаймні на 5 рівнів нижчий, ваш воїн не може битися з таким сильним ворогом і повинен натомість відповісти «Ви зазнали поразки».
     Кожен успішний бій також повертатиме одну з трьох відповідей: «Легкий бій», «Хороший бій», «Напружений бій». Поверніть «Легкий бій», якщо ваш воїн на 2 або більше рівнів вищий за рівень вашого ворога. Поверніть «Хороший бій», якщо ваш воїн на 1 рівень вищий або дорівнює рівню вашого ворога. Поверніть «Напружений бій», якщо рівень вашого воїна нижчий за рівень ворога.

Логічні приклади:

     Якщо воїн рівня 1 бореться з ворогом рівня 1, він отримає 10 очок досвіду.
     Якщо воїн рівня 1 бореться з ворогом рівня 3, він отримає 80 очок досвіду.
     Якщо воїн 5 рівня бореться з ворогом 4 рівня, він отримає 5 очок досвіду.
     Якщо воїн 3 рівня бореться з ворогом 9 рівня, він отримає 720 очок досвіду, в результаті чого воїн підніметься принаймні на 7 рівнів.
     Якщо воїн 8-го рівня бореться з ворогом 13-го рівня, він отримає 0 очок досвіду та відповість «Ви зазнали поразки». (Пам’ятайте, що для цього необхідно встановити різницю в ранзі та рівні ворога на 5 або більше рівнів.)
     Якщо воїн 6 рівня бореться з ворогом 2 рівня, він отримає 0 очок досвіду.

Правила навчання та розрахунки:

     Окрім отримання очок досвіду в боях, воїни також можуть отримати очки досвіду під час тренувань.
     Навчання прийматиме масив із трьох елементів (за винятком java, де ви отримаєте 3 окремі аргументи): опис, очки досвіду, які заробляє ваш воїн, і вимоги до мінімального рівня.
     Якщо рівень воїна відповідає вимогам мінімального рівня, воїн отримає від нього очки досвіду та збереже опис навчання. Він також має повернути цей опис.
     Якщо рівень воїна не відповідає вимогам мінімального рівня, воїн не отримує очки досвіду та опис, а натомість повертає «Недостатньо сильний» без будь-якого архівування результату. 
     
      Code Examples:

var bruce_lee = new Warrior();
bruce_lee.lvl();        // => 1
bruce_lee.exp();   // => 100
bruce_lee.rk();         // => "Pushover"
bruce_lee.achieve(); // => []
bruce_lee.training(["Defeated Chuck Norris", 9000, 1]); // => "Defeated Chuck Norris"
bruce_lee.exp();   // => 9100
bruce_lee.lvl();        // => 91
bruce_lee.rk();         // => "Master"
bruce_lee.battle(90);     // => "A good fight"
bruce_lee.exp();   // => 9105
bruce_lee.achieve(); // => ["Defeated Chuck Norris"]
*/

// Create a Warrior class
// It must support lvl, rk, exp, achieve, training(event), and battle(enemy_lvl) methods

class Warrior {
  constructor() {
    this.lvl = 1;
    this.exp = 100;
    this.rk = "Pushover";
    this.achieve = [];
  }

  addExp(points) {
    if (this.exp + points <= 10000) {
      this.exp += points;
    } else {
      this.exp = 10000;
    }

    this.lvl = Math.trunc(this.exp / 100);
    this.rk = ["Pushover", "Novice", "Fighter", "Warrior", "Veteran", "Sage", "Elite", "Conqueror", "Champion", "Master", "Greatest"][Math.trunc(this.lvl / 10)];
  }

  level() {
    return this.lvl;
  }

  experience() {
    return this.exp;
  }

  rank() {
    return this.rk;
  }

  achievements() {
    return this.achieve;
  }

  training(event) {
    if (this.lvl >= event[2]) {
      this.addExp(event[1]);
      this.achieve.push(event[0]);
    } else {
      return "Not strong enough";
    }

    return event[0];
  }

  battle(enemy_lvl) {
    let diff = enemy_lvl - this.lvl;

    if (enemy_lvl > 100 || enemy_lvl <= 0) {
      return "Invalid level";
    } else if (Math.trunc(this.lvl / 10) < Math.trunc(enemy_lvl / 10) && (diff >= 5)) {
      return "You've been defeated";
    } else if (diff === 0 || -diff === 1) {
      this.addExp(10 + 5 * diff);
      return "A good fight";
    } else if (-diff >= 2) {
      return "Easy fight";
    } else if (diff >= 1) {
      this.addExp(20 * diff * diff);
      return "An intense fight";
    }
  }
}

let bruce_lee = new Warrior();
console.log(bruce_lee.level());        // => 1
console.log(bruce_lee.experience());   // => 100
console.log(bruce_lee.rank());         // => "Pushover"
console.log(bruce_lee.achievements()); // => []
console.log(bruce_lee.training(["Defeated Chuck Norris", 9000, 1])); // => "Defeated Chuck Norris"
console.log(bruce_lee.experience());   // => 9100
console.log(bruce_lee.level());        // => 91
console.log(bruce_lee.rank());         // => "Master"
console.log(bruce_lee.battle(90));     // => "A good fight"
console.log(bruce_lee.experience());   // => 9105
console.log(bruce_lee.achievements()); // => ["Defeated Chuck Norris"]
