/*Визначте функцію, яка приймає цілий аргумент і повертає логічне значення true або false 
залежно від того, чи є ціле число простим.
У Вікіпедії просте число (або просте число) — це натуральне число, більше за 1, яке не має 
додатних дільників, крім 1 і самого себе.
Вимоги:
- Ви можете припустити, що вам буде надано ціле число.
- Не можна вважати, що ціле число буде тільки додатним. Ви також можете отримати від’ємні 
числа (або 0).
- ПРИМІТКА щодо продуктивності. Немає потреби в химерній оптимізації, але все одно 
найтривіальніші рішення можуть закінчитися. Числа досягають 2^31 (або подібних, залежно 
  від мови). Цикл аж до n або n/2 буде надто повільним.

приклад:
is_prime(1) /* false 
is_prime(2)  правда 
is_prime(-1)  false */


function isPrime(number) {
  if (number > 2 && number % 2 !== 0) {
    for (let i = 3; i <= Math.sqrt(number); i += 2) {
      if (number % i === 0) {
        return false;
      }
    }
  } else {
    return number === 2;
  }

  return true;
}

console.log(isPrime(1));
console.log(isPrime(2));
console.log(isPrime(-1));
console.log(isPrime(-6));
console.log(isPrime(19));
console.log(isPrime(4));
