/*Ваше завдання побудувати будівлю, яка буде являти собою купу з n кубиків.
Куб у нижній частині матиме об’єм n^3, куб угорі матиме об’єм (n−1)^3 і так далі до верхнього, 
який матиме об’єм 1^3.

Вам задано загальний об’єм будівлі в м. Якщо вам дано m, чи можете ви знайти кількість n кубиків, 
які вам доведеться побудувати?
Параметр функції findNb (find_nb, find-nb, findNb, ...)
буде цілим числом m, і ви повинні повернути ціле число n, 
наприклад n^3 + (n-1)^3 + (n-2)^3 + ... + 1^3 = m, якщо таке n існує або - 1 якщо
немає такого n.

приклади:
findNb(1071225) --> 45
findNb(91716553919377) --> -1*/

function findNb(volume) {
  let n = 0;
  let sum = 0;

  do {
    n++;
    sum += n ** 3;
  } while (sum < volume)

  if (sum > volume) {
    n = -1;
  }

  return n;
}

console.log(findNb(1071225));
console.log(findNb(91716553919377));
