/* Ваше завдання розрахувати мінімальну кількість ходів, щоб виграти гру
«Ханойські вежі», із заданою кількістю дисків.

Ханойські вежі - це проста гра, яка складається з трьох стержнів і числа
дисків різного розміру, які можуть ковзати на будь-який стрижень. Головоломка
починається з дисків у акуратному стосі в порядку зростання розміру на один
стрижень, найменший у верхній частині, таким чином роблячи конічну форму.

Мета головоломки - перемістити всю стопку на інший стрижень,
дотримуючись наступних простих правил:

За один раз можна перемістити лише один диск.
Кожен хід складається з взяття верхнього диска з однієї зі стопок і
помістивши його поверх іншого стека, тобто диск можна перемістити, лише якщо він
є найвищим диском у стеку.
Жоден диск не може бути розміщений поверх диска меншого розміру.*/

function towersHanoi(n) {
  return 2 ** n - 1;
}

console.log(towersHanoi(3));
console.log(towersHanoi(5));
console.log(towersHanoi(10));
