/* Розпакуйте смачні сосиски!

Прибула вантажівка з доставкою їжі, яка перевозила коробки смачних сосисок, і ваше завдання 
розпакувати їх і поставити на вітрину магазину.
Вантажівка заповнена ящиками з товарами. Серед товарів є різні види ковбас. Прямі ковбаски I, 
пишні ковбаски ), навіть кручені ковбаски @ та багато іншого. Найнадійніший спосіб відрізнити 
будь-який тип ковбаси від інших товарів – це упаковка [], яка використовується виключно для ковбас. 
Обов’язково ігноруйте інші товари, про них подбає хтось інший. Розпакувавши всі сосиски, 
просто розкладіть їх на лічильнику (рядок) у тому ж порядку, в якому вони надходили в коробки, 
з одним проміжком « » між кожною сосискою. О, і стережіться зіпсованих або пошкоджених пачок ковбаси, 
я вам про це розповідав?
Ковбаси завжди упаковані по чотири, і в кожній упаковці міститься лише один вид ковбаси, тому, якщо є 
якісь порушення, ковбаси, ймовірно, зіпсовані або пошкоджені, і всю упаковку слід викинути!
Тепер ми переходимо до найкращої частини – вашої винагороди! Замість грошей вам заплатять чимось 
набагато кращим – ковбасою! Кожна п'ята неушкоджена перероблена пачка ковбас не потрапляє на прилавок, 
а залишається у вас. Не витрачайте все відразу!
Якщо вантажівка приїде абсолютно порожньою, тільки з порожніми ящиками або тільки з товаром, який 
не є ковбасою, лічильник дисплея просто залишиться порожнім "". На відміну від вантажівки та ящиків, 
які можуть бути порожніми, кожен існуючий продукт є непорожнім рядком.
приклад:
Input (truck with 5 boxes containing 11 products):
[ [ "(-)", "[IIII]", "[))))]" ], [ "IuI", "[llll]" ], [ "[@@@@]", "UwU",
"[IlII]" ], [ "IuI", "[))))]", "x" ], [] ]
"Truck is an array, packages are arrays, packages of goods are strings"
Output (four sets of sausages):
"I I I I ) ) ) ) l l l l @ @ @ @"
Explanation:
The last box is empty and is therefore ignored
Packages with products that are not sausages are ignored - "(-)", "IuI",
"UwU", "IuI", "x"
Один пошкоджений пакет викидається - "[IlII]"
П’ятий неушкоджений пакунок використовується як ваша нагорода, тому його виключено з результату: «[))))]»
Більше прикладів введення та очікуваного результату можна побачити в прикладах тестових випадків */

function unpackSausages(arr) {
  let sausages = "";
  let count = 0;

  for (let i = 0; i < arr.length; i++) {
    for (let j = 0; j < arr[i].length; j++) {
      if (arr[i][j][0] === "[" && arr[i][j][arr[i][j].length - 1] === "]") {
        let set = new Set(arr[i][j].slice(1, -1));
        if (set.size === 1 && arr[i][j].slice(1, -1).length === 4) {
          count++;
          if (count !== 5) {
            sausages += arr[i][j].slice(1, -1).split("").join(" ") + " ";
          } else {
            count = 0;
          }
        }
      }
    }
  }

  return sausages.trim();
}

console.log(unpackSausages([["(-)", "[IIII]", "[))))]"], ["IuI", "[llll]"], ["[@@@@]", "UwU",
  "[IlII]"], ["IuI", "[))))]", "x"], []]));
